micropython/micropython/ports/stm32/dma.c
        HAL_NVIC_EnableIRQ(dma_irqn[dma_id]);
    }
}

void dma_deinit(const dma_descr_t *dma_descr) {
    if (dma_descr != NULL) {
        #if !defined(STM32F0)
        HAL_NVIC_DisableIRQ(dma_irqn[dma_descr->id]);
        #endif
        dma_handle[dma_descr->id] = NULL;

        dma_disable_clock(dma_descr->id);
    }
}

void dma_invalidate_channel(const dma_descr_t *dma_descr) {
    if (dma_descr != NULL) {
        dma_id_t dma_id = dma_descr->id;
        // Only compare the sub-instance, not the direction bit (MSB)
        if ((dma_last_sub_instance[dma_id] & 0x7f) == DMA_SUB_INSTANCE_AS_UINT8(dma_descr->sub_instance)) {
            dma_last_sub_instance[dma_id] = DMA_INVALID_CHANNEL;
        }
    }
}

#if MICROPY_HW_DMA_ENABLE_AUTO_TURN_OFF
// Called from the SysTick handler
// We use LSB of tick to select which controller to process
static void dma_idle_handler(uint32_t tick) {
    if (!DMA_IDLE_ENABLED() || !DMA_IDLE_TICK(tick)) {
        return;
    }

    static const uint32_t controller_mask[] = {
        DMA1_ENABLE_MASK,
        #if defined(DMA2) || defined(GPDMA2)
        DMA2_ENABLE_MASK,
        #endif
    };
    {
        int controller = (tick >> DMA_SYSTICK_LOG2) & 1;
        if (dma_idle.counter[controller] == 0) {
            return;
        }
        if (++dma_idle.counter[controller] > DMA_IDLE_TICK_MAX) {
            if ((dma_enable_mask & controller_mask[controller]) == 0) {
                // Nothing is active and we've reached our idle timeout,
                // Now we'll really disable the clock.
                dma_idle.counter[controller] = 0;
                if (controller == 0) {
                    __HAL_RCC_DMA1_CLK_DISABLE();
                    #if defined(STM32G4)
                    #if defined(DMA2) || defined(GPDMA2)
                    if (__HAL_RCC_DMA2_IS_CLK_DISABLED())
                    #endif
                    {
                        __HAL_RCC_DMAMUX1_CLK_DISABLE();
                    }
                    #endif
                }
                #if defined(DMA2) || defined(GPDMA2)
                else {
                    __HAL_RCC_DMA2_CLK_DISABLE();
                    #if defined(STM32G4)
                    if (__HAL_RCC_DMA1_IS_CLK_DISABLED()) {
                        __HAL_RCC_DMAMUX1_CLK_DISABLE();
                    }
                    #endif
                }
                #endif
            } else {
                // Something is still active, but the counter never got
                // reset, so we'll reset the counter here.
                dma_idle.counter[controller] = 1;
            }
        }
    }
}
#endif

#if defined(STM32F0) || defined(STM32G0) || defined(STM32G4) || defined(STM32L0) || defined(STM32L1) || defined(STM32L4)

void dma_nohal_init(const dma_descr_t *descr, uint32_t config) {
    DMA_Channel_TypeDef *dma = descr->instance;

    // Enable the DMA peripheral
    dma_enable_clock(descr->id);

    // Set main configuration register
    dma->CCR =
        descr->init->Priority       // PL
        | descr->init->MemInc       // MINC
        | descr->init->PeriphInc    // PINC
        | config                    // MSIZE | PSIZE | CIRC | DIR
    ;

    // Select channel that the DMA stream uses
    #if defined(STM32F0)
    if (dma < DMA2_Channel1) {
        __HAL_DMA1_REMAP(descr->sub_instance);
    } else {
        __HAL_DMA2_REMAP(descr->sub_instance);
    }
    #elif defined(STM32G0) || defined(STM32G4)
    uint32_t *dmamux_ctrl = (void *)(DMAMUX1_Channel0_BASE + 0x04 * descr->id);
    *dmamux_ctrl = (*dmamux_ctrl & ~(0x7f)) | descr->sub_instance;
    #elif defined(STM32L1)
    #else
    DMA_Request_TypeDef *dma_ctrl = (void *)(((uint32_t)dma & ~0xff) + (DMA1_CSELR_BASE - DMA1_BASE)); // DMA1_CSELR or DMA2_CSELR
    uint32_t channel_number = (((uint32_t)dma & 0xff) - 0x08) / 20; // 0 through 6
    uint32_t channel_pos = channel_number * 4;
    dma_ctrl->CSELR = (dma_ctrl->CSELR & ~(0xf << channel_pos)) | (descr->sub_instance << channel_pos);
    #endif
}

void dma_nohal_deinit(const dma_descr_t *descr) {
    DMA_Channel_TypeDef *dma = descr->instance;
    dma->CCR &= ~DMA_CCR_EN;
    dma->CCR = 0;
    dma->CNDTR = 0;
    dma_deinit(descr);
}

void dma_nohal_start(const dma_descr_t *descr, uint32_t src_addr, uint32_t dst_addr, uint16_t len) {
    DMA_Channel_TypeDef *dma = descr->instance;
    dma->CNDTR = len;
    dma->CPAR = dst_addr;
    dma->CMAR = src_addr;
    dma->CCR |= DMA_CCR_EN;
}

#elif defined(STM32H5) || defined(STM32U5)

// Fully setup GPDMA linked list entry
typedef struct _dma_ll_full_t {
    __IO uint32_t CTR1;
    __IO uint32_t CTR2;
    __IO uint32_t CBR1;
    __IO uint32_t CSAR;
    __IO uint32_t CDAR;
    __IO uint32_t CLLR;
} dma_ll_full_t;

// Align LL entry to 32 bytes to ensure it never crosses a 64 kB boundary
__ALIGNED(32) static __IO dma_ll_full_t lli1;

void dma_nohal_init(const dma_descr_t *descr, uint32_t config) {
    DMA_Channel_TypeDef *dma = descr->instance;
    const DMA_InitTypeDef *init = descr->init;

    // Enable the DMA peripheral
    dma_enable_clock(descr->id);

    // - LSM = 0, normal linked list mode
    // - No interrupts
    // - Not suspended, out of reset, disabled
    // - Priority as defined by user
    dma->CCR = init->Priority;

    uint32_t ctr1reg = 0;
    ctr1reg |= config & DMA_CTR1_SDW_LOG2_Msk;
    ctr1reg |= init->SrcInc;
    ctr1reg |= (((init->SrcBurstLength - 1) << DMA_CTR1_SBL_1_Pos)) & DMA_CTR1_SBL_1_Msk;
    ctr1reg |= config & DMA_CTR1_DDW_LOG2_Msk;
    ctr1reg |= init->DestInc;
    ctr1reg |= (((init->DestBurstLength - 1) << DMA_CTR1_DBL_1_Pos)) & DMA_CTR1_DBL_1_Msk;

    uint32_t ctr2reg = 0;
    ctr2reg |= init->BlkHWRequest;
    ctr2reg |= init->Direction;
    ctr2reg |= init->Mode;
    ctr2reg |= init->TransferEventMode;
    ctr2reg |= init->TransferAllocatedPort;
    uint32_t reqsel = descr->sub_instance;
    ctr2reg |= (reqsel << DMA_CTR2_REQSEL_Pos) & DMA_CTR2_REQSEL_Msk;

    dma->CBR1 = 0;  // set length to zero, so that GPDMA engine fetches first LL entry immediately
    dma->CSAR = 0;
    dma->CDAR = 0;

    // Attach linked list entry
    dma->CLBAR = (uint32_t)(&lli1) & 0xffff0000UL;  // upper 16 bits of linked list addresses

    uint32_t cllrreg = 0;
    cllrreg |= (DMA_CLLR_UT1 | DMA_CLLR_UT2 | DMA_CLLR_UB1 | DMA_CLLR_USA | DMA_CLLR_UDA | DMA_CLLR_ULL);
    cllrreg |= (uint32_t)(&lli1) & 0x0000fffcUL;    // lower 16 bits of linked list entry address
    dma->CLLR = cllrreg;

    // Setup linked list control registers. Length and addresses are set in dma_nohal_start()
    lli1.CTR1 = ctr1reg;
    lli1.CTR2 = ctr2reg;

