micropython/micropython/ports/stm32/dma.c
    if ((config & DMA_CIRCULAR) == DMA_CIRCULAR) {
        lli1.CLLR = cllrreg;    // pointer to itself for circular operation
    } else {
        lli1.CLLR = 0;  // No next node, this is end of linked list chain
    }
}

void dma_nohal_deinit(const dma_descr_t *descr) {
    DMA_Channel_TypeDef *dma = descr->instance;

    if ((dma->CCR & DMA_CCR_EN) == DMA_CCR_EN) {
        // Suspend currently running channel. Wait until done, then reset to clear FIFOs.
        dma->CCR |= DMA_CCR_SUSP;

        uint32_t t0 = mp_hal_ticks_ms();
        while ((dma->CSR & DMA_CSR_SUSPF) != DMA_CSR_SUSPF) {
            if (mp_hal_ticks_ms() - t0 >= 100) {
                // Timeout.. Abort to avoid blocking system forever
                break;
            }
        }

        dma->CCR |= DMA_CCR_RESET;
    }
    dma->CCR &= ~DMA_CCR_EN;
    dma->CCR = 0;
    dma_deinit(descr);
}

void dma_nohal_start(const dma_descr_t *descr, uint32_t src_addr, uint32_t dst_addr, uint16_t len) {
    DMA_Channel_TypeDef *dma = descr->instance;
    lli1.CBR1 = (len << DMA_CBR1_BNDT_Pos) & DMA_CBR1_BNDT_Msk;
    lli1.CSAR = src_addr;
    lli1.CDAR = dst_addr;

    dma->CCR |= DMA_CCR_EN;
}

#elif defined(STM32N6) || defined(STM32WB) || defined(STM32WL)

// These functions are currently not implemented or needed for this MCU.

#else

void dma_nohal_init(const dma_descr_t *descr, uint32_t config) {
    DMA_Stream_TypeDef *dma = descr->instance;

    // Enable the DMA peripheral
    dma_enable_clock(descr->id);

    // Set main configuration register
    const DMA_InitTypeDef *init = descr->init;
    dma->CR =
        descr->sub_instance         // CHSEL
        | init->MemBurst            // MBURST
        | init->PeriphBurst         // PBURST
        | init->Priority            // PL
        | init->MemInc              // MINC
        | init->PeriphInc           // PINC
        | config                    // MSIZE | PSIZE | CIRC | DIR
    ;

    // Set FIFO control register
    dma->FCR =
        init->FIFOMode              // DMDIS
        | init->FIFOThreshold       // FTH
    ;

    #if defined(STM32H7)
    // Configure DMAMUX
    uint32_t request = descr->sub_instance & DMAMUX_CxCR_DMAREQ_ID;
    if ((dma >= DMA1_Stream0 && dma <= DMA1_Stream7) || (dma >= DMA2_Stream0 && dma <= DMA2_Stream7)) {
        // DMA1/2 channels 0 to 7 are hardwired to DMAMUX1 channels 0-15.
        uint32_t stream = (((uint32_t)dma & 0xff) - 16) / 24 + ((dma >= DMA2_Stream0) ? 8 : 0);
        // Set DMAMUX channel peripheral request.
        ((DMAMUX_Channel_TypeDef *)(((uint32_t)DMAMUX1_Channel0) + (stream * 4)))->CCR = request;
        DMAMUX1_ChannelStatus->CFR = 1 << (stream & 0x1F);
        // Configure DMAMUX request generator if needed.
        if (request >= DMA_REQUEST_GENERATOR0 && request <= DMA_REQUEST_GENERATOR7) {
            ((DMAMUX_RequestGen_TypeDef *)(((uint32_t)DMAMUX1_RequestGenerator0) + ((request - 1) * 4)))->RGCR = 0;
            DMAMUX1_RequestGenStatus->RGCFR = 1 << (request - 1);
        }
    #if ENABLE_BDMA // TODO: BDMA is Not currently supported by this driver.
    } else if (dma >= BDMA_Channel0 && dma <= BDMA_Channel7) {
        // BDMA channels 0 to 7 are hardwired to DMAMUX2 channels 0-7.
        uint32_t stream = (((uint32_t)dma & 0xff) - 8) / 20;
        // Set DMAMUX channel peripheral request.
        ((DMAMUX_Channel_TypeDef *)(((uint32_t)DMAMUX2_Channel0) + (stream * 4)))->CCR = request;
        DMAMUX2_ChannelStatus->CFR = 1 << (stream & 0x1F);
        // Configure DMAMUX request generator if needed.
        if (request >= DMA_REQUEST_GENERATOR0 && request <= DMA_REQUEST_GENERATOR7) {
            ((DMAMUX_RequestGen_TypeDef *)(((uint32_t)DMAMUX2_RequestGenerator0) + ((request - 1) * 4)))->RGCR = 0;
            DMAMUX2_RequestGenStatus->RGCFR = 1 << (request - 1);
        }
    #endif // ENABLE_BDMA
    }
    #endif // STM32H7
}

void dma_nohal_deinit(const dma_descr_t *descr) {
    DMA_Stream_TypeDef *dma = descr->instance;
    dma->CR &= ~DMA_SxCR_EN;
    uint32_t t0 = mp_hal_ticks_ms();
    while ((dma->CR & DMA_SxCR_EN) && mp_hal_ticks_ms() - t0 < 100) {
    }
    dma->CR = 0;
    dma->NDTR = 0;
    dma->FCR = 0x21;
    dma_deinit(descr);
}

void dma_nohal_start(const dma_descr_t *descr, uint32_t src_addr, uint32_t dst_addr, uint16_t len) {
    // Must clear all event flags for this stream before enabling it
    DMA_TypeDef *dma_ctrl;
    uint32_t ch = descr->id;
    if (ch < NSTREAMS_PER_CONTROLLER) {
        dma_ctrl = DMA1;
    } else {
        dma_ctrl = DMA2;
        ch -= NSTREAMS_PER_CONTROLLER;
    }
    __IO uint32_t *ifcr;
    if (ch <= 3) {
        ifcr = &dma_ctrl->LIFCR;
    } else {
        ifcr = &dma_ctrl->HIFCR;
        ch -= 4;
    }
    if (ch <= 1) {
        ch = ch * 6;
    } else {
        ch = 4 + ch * 6;
    }
    *ifcr = 0x3d << ch;

    // Configure and enable stream
    DMA_Stream_TypeDef *dma = descr->instance;
    dma->CR &= ~DMA_SxCR_DBM;
    dma->NDTR = len;
    dma->PAR = dst_addr;
    dma->M0AR = src_addr;
    dma->CR |= DMA_SxCR_EN;
}

#endif

#define DMA_ID_FROM_CONTROLLER_STREAM(c, s) ((s) + (c) * NSTREAMS_PER_CONTROLLER)

void dma_external_acquire(uint32_t controller, uint32_t stream) {
    dma_enable_clock(DMA_ID_FROM_CONTROLLER_STREAM(controller, stream));
}

void dma_external_release(uint32_t controller, uint32_t stream) {
    dma_disable_clock(DMA_ID_FROM_CONTROLLER_STREAM(controller, stream));
}

#if __DCACHE_PRESENT

void dma_protect_rx_region(void *dest, size_t len) {
    #if __DCACHE_PRESENT
    uint32_t start_addr = (uint32_t)dest;
    uint32_t start_aligned = start_addr & ~(__SCB_DCACHE_LINE_SIZE - 1U);
    uint32_t end_addr = start_addr + len - 1; // Address of last byte in the buffer
    uint32_t end_aligned = end_addr & ~(__SCB_DCACHE_LINE_SIZE - 1U);

    uint32_t irq_state = mpu_config_start();

    // Clean (write back) any cached memory in this region, so there's no dirty
    // cache entries that might be written back later after DMA RX is done.
    MP_HAL_CLEAN_DCACHE(dest, len);

    // The way we protect the whole region is to mark the first and last cache
    // line as UNCACHED using the MPU. This means any unrelated reads/writes in
    // these cache lines will bypass the cache, and can coexist with DMA also
    // writing to parts of these cache lines.
    //
    // This is redundant sometimes (because the DMA region fills the entire cache line, or because
    // the region fits in a single cache line.) However, the implementation is only 3 register writes so
    // it's more efficient to call it every time.
    mpu_config_region(MPU_REGION_DMA_UNCACHED_1, start_aligned, MPU_CONFIG_UNCACHED(MPU_REGION_SIZE_32B));
    mpu_config_region(MPU_REGION_DMA_UNCACHED_2, end_aligned, MPU_CONFIG_UNCACHED(MPU_REGION_SIZE_32B));

    mpu_config_end(irq_state);
    #endif
}

void dma_unprotect_rx_region(void *dest, size_t len) {
    #if __DCACHE_PRESENT
    uint32_t irq_state = mpu_config_start();

    // Disabling these regions removes them from the MPU
    mpu_config_region(MPU_REGION_DMA_UNCACHED_1, 0, MPU_CONFIG_DISABLE);
    mpu_config_region(MPU_REGION_DMA_UNCACHED_2, 0, MPU_CONFIG_DISABLE);

    // Invalidate the whole region in the cache. This may seem redundant, but it
    // is possible that during the DMA operation the CPU read inside this region
    // (excluding the first & last cache lines), and cache lines were filled.
    //
    // (This can happen in SPI if src==dest, for example, possibly due to speculative
    // cache line fills.)
    MP_HAL_CLEANINVALIDATE_DCACHE(dest, len);

    mpu_config_end(irq_state);
    #endif
}

#endif
